package com.ifmo.lesson1;

public class IsEven {
    /*
    Напишите программу, которая выводит true, если число четное и false, если нет.
    Попробуйте сделать при помощи битовых операций.
     */
    public static void main(String[] args) {
        int n = 245;

if (n % 2 == 0)
{
    System.out.printf("True");
}
else System.out.println("False");;
    }

    public static boolean isEven(int n) {
        // TODO implement

        return false;
    }
}
